# Preicting house prices using linear regression with multiple variables

In [29]:
import pandas as pd
import math as mt
from sklearn import linear_model
from word2number import w2n

In [30]:
df = pd.read_csv("house_price_mutlivariable.csv")
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   18  595000
4  4000       5.0    8  760000

In [31]:
#Preprocessing Step filling the missing value
bed_missing_value = mt.ceil(df.bedrooms.mean())
df.bedrooms = df.bedrooms.fillna(bed_missing_value)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   18  595000
4  4000       5.0    8  760000

In [32]:
reg = linear_model.LinearRegression()
reg.fit(df[['area','bedrooms','age']],df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [33]:
reg.predict([[3500, 3, 22]])

array([580511.49208742])

# Problem to Solve

In [34]:
df_salary = pd.read_csv("salary.csv")
df_salary

  experience  test_score  interview_score  salary ($)
0        NaN         8.0                9       50000
1        NaN         8.0                6       45000
2       five         6.0                7       60000
3        two        10.0               10       65000
4      three         7.0               10       62000
5        ten         NaN                7       72000
6     eleven         7.0                8       80000

In [35]:

df_salary[['experience']] = df_salary[['experience']].fillna('zero')
df_salary[['test_score']]= df_salary[['test_score']].fillna(df_salary[['test_score']].mean())
df_salary

  experience  test_score  interview_score  salary ($)
0       zero    8.000000                9       50000
1       zero    8.000000                6       45000
2       five    6.000000                7       60000
3        two   10.000000               10       65000
4      three    7.000000               10       62000
5        ten    7.666667                7       72000
6     eleven    7.000000                8       80000

SyntaxError: invalid syntax (<ipython-input-38-113284eeb84a>, line 1)